module PostImagesHelper
    def list
        {a: "aaa", b: "bbb", c: "ccc"}
    end

    def grade
        [["8級", "8"],
        ["7級", "7"],
        ["6級", "6"],
        ["5級", "5"],
        ["4級", "4"],
        ["3級", "3"],
        ["2級", "2"],
        ["1級", "1"],
        ["1段", "-1"],
        ["2段", "-2"]]
    end

    def wall-type
        [["スラブ", "slab"],
        ["垂壁", "90"],
        ["薄かぶり:100°,120°", "100"],
        ["どっかぶり:130°~", "130"],
        ["ルーフ", "roof"],
        ["マントル", "mantle"]]
    end

end
